In [2]:
import numpy as np
import pandas as pd

In [3]:
?pd.DataFrame.to_csv

Signature:
pd.DataFrame.to_csv(
    self,
    path_or_buf: 'FilePath | WriteBuffer[bytes] | WriteBuffer[str] | None' = None,
    *,
    sep: 'str' = ',',
    na_rep: 'str' = '',
    float_format: 'str | Callable | None' = None,
    columns: 'Sequence[Hashable] | None' = None,
    header: 'bool_t | list[str]' = True,
    index: 'bool_t' = True,
    index_label: 'IndexLabel | None' = None,
    mode: 'str' = 'w',
    encoding: 'str | None' = None,
    compression: 'CompressionOptions' = 'infer',
    quoting: 'int | None' = None,
    quotechar: 'str' = '"',
    lineterminator: 'str | None' = None,
    chunksize: 'int | None' = None,
    date_format: 'str | None' = None,
    doublequote: 'bool_t' = True,
    escapechar: 'str | None' = None,
    decimal: 'str' = '.',
    errors: 'OpenFileErrors' = 'strict',
    storage_options: 'StorageOptions | None' = None,
) -> 'str | None'
Docstring:
Write object to a comma-separated values (csv) file.

Parameters
----------
path_or_buf : str, path object, file-like object, or None, default None
    String, path object (implementing os.PathLike[str]), or file-like
    object implementing a write() function. If None, the result is
    returned as a string. If a non-binary file object is passed, it should
    be opened with `newline=''`, disabling universal newlines. If a binary
    file object is passed, `mode` might need to contain a `'b'`.
sep : str, default ','
    String of length 1. Field delimiter for the output file.
na_rep : str, default ''
    Missing data representation.
float_format : str, Callable, default None
    Format string for floating point numbers. If a Callable is given, it takes
    precedence over other numeric formatting parameters, like decimal.
columns : sequence, optional
    Columns to write.
header : bool or list of str, default True
    Write out the column names. If a list of strings is given it is
    assumed to be aliases for the column names.
index : bool, default True
    Write row names (index).
index_label : str or sequence, or False, default None
    Column label for index column(s) if desired. If None is given, and
    `header` and `index` are True, then the index names are used. A
    sequence should be given if the object uses MultiIndex. If
    False do not print fields for index names. Use index_label=False
    for easier importing in R.
mode : {'w', 'x', 'a'}, default 'w'
    Forwarded to either `open(mode=)` or `fsspec.open(mode=)` to control
    the file opening. Typical values include:

    - 'w', truncate the file first.
    - 'x', exclusive creation, failing if the file already exists.
    - 'a', append to the end of file if it exists.

encoding : str, optional
    A string representing the encoding to use in the output file,
    defaults to 'utf-8'. `encoding` is not supported if `path_or_buf`
    is a non-binary file object.
compression : str or dict, default 'infer'
    For on-the-fly compression of the output data. If 'infer' and 'path_or_buf' is
    path-like, then detect compression from the following extensions: '.gz',
    '.bz2', '.zip', '.xz', '.zst', '.tar', '.tar.gz', '.tar.xz' or '.tar.bz2'
    (otherwise no compression).
    Set to ``None`` for no compression.
    Can also be a dict with key ``'method'`` set
    to one of {``'zip'``, ``'gzip'``, ``'bz2'``, ``'zstd'``, ``'xz'``, ``'tar'``} and
    other key-value pairs are forwarded to
    ``zipfile.ZipFile``, ``gzip.GzipFile``,
    ``bz2.BZ2File``, ``zstandard.ZstdCompressor``, ``lzma.LZMAFile`` or
    ``tarfile.TarFile``, respectively.
    As an example, the following could be passed for faster compression and to create
    a reproducible gzip archive:
    ``compression={'method': 'gzip', 'compresslevel': 1, 'mtime': 1}``.

    .. versionadded:: 1.5.0
        Added support for `.tar` files.

       May be a dict with key 'method' as compression mode
       and other entries as additional compression options if
       compression mode is 'zip'.

       Passing compression options as keys in dict is
       supported for compression modes 'gzip', 'bz2', 'zstd', and 'zip'.
quoting : optional constant from csv module
    Defaults to csv.QUOTE_MINIMAL. If you have set a `float_format`
    then floats are converted to strings and thus csv.QUOTE_NONNUMERIC
    will treat them as non-numeric.
quotechar : str, default '\"'
    String of length 1. Character used to quote fields.
lineterminator : str, optional
    The newline character or character sequence to use in the output
    file. Defaults to `os.linesep`, which depends on the OS in which
    this method is called ('\\n' for linux, '\\r\\n' for Windows, i.e.).

    .. versionchanged:: 1.5.0

        Previously was line_terminator, changed for consistency with
        read_csv and the standard library 'csv' module.

chunksize : int or None
    Rows to write at a time.
date_format : str, default None
    Format string for datetime objects.
doublequote : bool, default True
    Control quoting of `quotechar` inside a field.
escapechar : str, default None
    String of length 1. Character used to escape `sep` and `quotechar`
    when appropriate.
decimal : str, default '.'
    Character recognized as decimal separator. E.g. use ',' for
    European data.
errors : str, default 'strict'
    Specifies how encoding and decoding errors are to be handled.
    See the errors argument for :func:`open` for a full list
    of options.

storage_options : dict, optional
    Extra options that make sense for a particular storage connection, e.g.
    host, port, username, password, etc. For HTTP(S) URLs the key-value pairs
    are forwarded to ``urllib.request.Request`` as header options. For other
    URLs (e.g. starting with "s3://", and "gcs://") the key-value pairs are
    forwarded to ``fsspec.open``. Please see ``fsspec`` and ``urllib`` for more
    details, and for more examples on storage options refer `here
    <https://pandas.pydata.org/docs/user_guide/io.html?
    highlight=storage_options#reading-writing-remote-files>`_.

Returns
-------
None or str
    If path_or_buf is None, returns the resulting csv format as a
    string. Otherwise returns None.

See Also
--------
read_csv : Load a CSV file into a DataFrame.
to_excel : Write DataFrame to an Excel file.

Examples
--------
Create 'out.csv' containing 'df' without indices

>>> df = pd.DataFrame({'name': ['Raphael', 'Donatello'],
...                    'mask': ['red', 'purple'],
...                    'weapon': ['sai', 'bo staff']})
>>> df.to_csv('out.csv', index=False)  # doctest: +SKIP

Create 'out.zip' containing 'out.csv'

>>> df.to_csv(index=False)
'name,mask,weapon\nRaphael,red,sai\nDonatello,purple,bo staff\n'
>>> compression_opts = dict(method='zip',
...                         archive_name='out.csv')  # doctest: +SKIP
>>> df.to_csv('out.zip', index=False,
...           compression=compression_opts)  # doctest: +SKIP

To write a csv file to a new folder or nested folder you will first
need to create it using either Pathlib or os:

>>> from pathlib import Path  # doctest: +SKIP
>>> filepath = Path('folder/subfolder/out.csv')  # doctest: +SKIP
>>> filepath.parent.mkdir(parents=True, exist_ok=True)  # doctest: +SKIP
>>> df.to_csv(filepath)  # doctest: +SKIP

>>> import os  # doctest: +SKIP
>>> os.makedirs('folder/subfolder', exist_ok=True)  # doctest: +SKIP
>>> df.to_csv('folder/subfolder/out.csv')  # doctest: +SKIP
File:      d:\anaconda3\lib\site-packages\pandas\core\generic.py
Type:      function

In [4]:
# arr = np.array(
#     [['a', 'b', 'c', 'd', 'message'],
#      [1, 2, 3, 4, 'hello'],
#      [5, 6, 7, 8, 'world'],
#      [9, 10, 11, 12, 'foo']]
# )           !!!!!!!np要统一数据类型所以不能用np.savetxt
data = {
    'a': [1, 5, 9],
    'b': [2, 6, 10],
    'c': [3, 7, 11],
    'd': [4, 8, 12],
    'message': ['hello', 'world', 'foo']
}

In [5]:
df = pd.DataFrame(data)
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
df.to_csv('ex1.csv', index = False)

In [7]:
pd.read_csv('ex1.csv')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
pd.read_csv('ex1.csv').info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   a        3 non-null      int64
 1   b        3 non-null      int64
 2   c        3 non-null      int64
 3   d        3 non-null      int64
 4   message  3 non-null      object
dtypes: int64(4), object(1)
memory usage: 252.0+ bytes

In [9]:
pd.read_csv('ex1.csv').dtypes

a           int64
b           int64
c           int64
d           int64
message    object
dtype: object

In [10]:
#Direct read
pd.read_csv('ex1.csv', header = [0,1])

   a   b   c   d message
   1   2   3   4   hello
0  5   6   7   8   world
1  9  10  11  12     foo

In [11]:
pd.read_csv('ex1.csv', header = [0,1]).columns

MultiIndex([(      'a',     '1'),
            (      'b',     '2'),
            (      'c',     '3'),
            (      'd',     '4'),
            ('message', 'hello')],
           )

In [12]:
#The impact of the number of names on columns
pd.read_csv('ex1.csv',
           header = None,
           names = list('abcde'))

   a   b   c   d        e
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [13]:
pd.read_csv('ex1.csv',
           header = None,
           names = list('abcdefg'))

   a   b   c   d        e   f   g
0  a   b   c   d  message NaN NaN
1  1   2   3   4    hello NaN NaN
2  5   6   7   8    world NaN NaN
3  9  10  11  12      foo NaN NaN

In [14]:
pd.read_csv('ex1.csv',
           header = None,
           names = list('abc'))

       a   b        c
a b    c   d  message
1 2    3   4    hello
5 6    7   8    world
9 10  11  12      foo

In [15]:
pd.read_csv('ex1.csv',
           header = None,
           names = list('abc')).index

MultiIndex([('a',  'b'),
            ('1',  '2'),
            ('5',  '6'),
            ('9', '10')],
           )

In [16]:
pd.read_csv('ex1.csv')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [19]:
# index_col
pd.read_csv('ex1.csv', index_col = 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [20]:
pd.read_csv('ex1.csv', index_col = 'message').index

Index(['hello', 'world', 'foo'], dtype='object', name='message')

In [21]:
pd.read_csv('ex1.csv', 
            header = None,
            names = list('abcde'),
            index_col = 'e')

         a   b   c   d
e
message  a   b   c   d
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [22]:
pd.read_csv('ex1.csv', 
            header = None,
            names = list('abcde'),
            index_col = 4)

         a   b   c   d
e
message  a   b   c   d
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [23]:
#Build a hierarchical index with multiple columns
pd.read_csv('Database/data/mindex.csv')

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [24]:
pd.read_csv('Database/data/mindex.csv', index_col = ['key1', 'key2'])

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [25]:
pd.read_csv('Database/data/mindex.csv', index_col = ['key1'])

     key2  value1  value2
key1
one     a       1       2
one     b       3       4
one     c       5       6
one     d       7       8
two     a       9      10
two     b      11      12
two     c      13      14
two     d      15      16

In [26]:
# sep
pd.read_csv('Database/data/ex3.csv')

               A         B         C
0  aaa -0.264438 -1.026059 -0.619500
1  bbb  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  ddd -0.871858 -0.348382  1.100491

In [28]:
pd.read_csv('Database/data/ex3.csv').info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0               A         B         C  4 non-null      object
dtypes: object(1)
memory usage: 164.0+ bytes

In [31]:
pd.read_csv('Database/data/ex3.csv', sep = '\s+') # \s+ :正则表达式

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
C:\Users\lenovo\AppData\Local\Temp\ipykernel_30264\2089079404.py:1: SyntaxWarning: invalid escape sequence '\s'
  pd.read_csv('Database/data/ex3.csv', sep = '\s+') # \s+ :正则表达式

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [32]:
# Skiprows
pd.read_csv('Database/data/ex4.csv')

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [33]:
pd.read_csv('Database/data/ex4.csv', skiprows = [0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [35]:
# comment 指定注释行
pd.read_csv('Database/data/ex4.csv', comment = '#')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [36]:
pd.read_csv('Database/data/pingan.csv', index_col='date')

,open,high,close,low,volume,price_change,p_change,ma5,ma10,ma20,v_ma5,v_ma10,v_ma20,turnover
date,,,,,,,,,,,,,,
2018-08-27,63.08,63.68,63.47,62.72,585793.44,1.00,1.60,63.470,63.470,63.470,585793.44,585793.44,585793.44,0.54
2018-08-28,63.80,63.84,62.90,62.60,424944.22,-0.57,-0.90,63.185,63.185,63.185,505368.83,505368.83,505368.83,0.39
2018-08-29,62.68,63.30,63.01,62.65,278926.78,0.11,0.17,63.127,63.127,63.127,429888.15,429888.15,429888.15,0.26
2018-08-30,63.50,64.05,63.16,63.02,458496.34,0.15,0.24,63.135,63.135,63.135,437040.20,437040.20,437040.20,0.42
2018-08-31,62.40,63.43,62.98,62.20,521114.00,-0.18,-0.28,63.104,63.104,63.104,453854.96,453854.96,453854.96,0.48
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2021-02-09,78.56,78.56,78.13,76.80,914121.88,-0.44,-0.56,78.516,79.307,82.405,1063326.38,1004352.32,1143667.77,0.84
2021-02-10,77.90,79.81,79.25,77.49,919686.75,1.12,1.43,79.058,78.928,81.991,978495.13,1028047.22,1120104.94,0.85
2021-02-18,81.50,82.86,82.38,80.89,1466782.00,3.13,3.95,79.610,79.074,81.846,988541.98,1068616.70,1124480.35,1.35
2021-02-19,82.00,84.56,84.20,81.68,1240617.62,1.82,2.21,80.506,79.586,81.711,1067551.05,1065698.42,1107156.98,1.15
2021-02-22,84.25,85.29,83.00,82.58,1130341.12,-1.20,-1.43,81.392,79.959,81.501,1134309.87,1106242.39,1105553.04,1.04

In [37]:
pd.read_csv('Database/data/pingan.csv', index_col='date').index

Index(['2018-08-27', '2018-08-28', '2018-08-29', '2018-08-30', '2018-08-31',
       '2018-09-03', '2018-09-04', '2018-09-05', '2018-09-06', '2018-09-07',
       ...
       '2021-02-02', '2021-02-03', '2021-02-04', '2021-02-05', '2021-02-08',
       '2021-02-09', '2021-02-10', '2021-02-18', '2021-02-19', '2021-02-22'],
      dtype='object', name='date', length=602)

In [38]:
pd.read_csv('Database/data/pingan.csv', index_col='date').info()

<class 'pandas.core.frame.DataFrame'>
Index: 602 entries, 2018-08-27 to 2021-02-22
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   open          602 non-null    float64
 1   high          602 non-null    float64
 2   close         602 non-null    float64
 3   low           602 non-null    float64
 4   volume        602 non-null    float64
 5   price_change  602 non-null    float64
 6   p_change      602 non-null    float64
 7   ma5           602 non-null    float64
 8   ma10          602 non-null    float64
 9   ma20          602 non-null    float64
 10  v_ma5         602 non-null    float64
 11  v_ma10        602 non-null    float64
 12  v_ma20        602 non-null    float64
 13  turnover      602 non-null    float64
dtypes: float64(14)
memory usage: 70.5+ KB

In [39]:
pd.read_csv('Database/data/pingan.csv', index_col='date', parse_dates=True).index

DatetimeIndex(['2018-08-27', '2018-08-28', '2018-08-29', '2018-08-30',
               '2018-08-31', '2018-09-03', '2018-09-04', '2018-09-05',
               '2018-09-06', '2018-09-07',
               ...
               '2021-02-02', '2021-02-03', '2021-02-04', '2021-02-05',
               '2021-02-08', '2021-02-09', '2021-02-10', '2021-02-18',
               '2021-02-19', '2021-02-22'],
              dtype='datetime64[ns]', name='date', length=602, freq=None)

In [ ]:
# 下面是一组dtype用法对比

In [40]:
pd.read_csv('Database/data/ex7.csv')

   a  b  c
0  1  2  3
1  1  2  3

In [41]:
pd.read_csv('Database/data/ex7.csv').info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       2 non-null      int64
 1   b       2 non-null      int64
 2   c       2 non-null      int64
dtypes: int64(3)
memory usage: 180.0 bytes

In [42]:
pd.read_csv('Database/data/ex7.csv').dtypes

a    int64
b    int64
c    int64
dtype: object

In [43]:
pd.read_csv('Database/data/ex7.csv', dtype=str)

   a  b  c
0  1  2  3
1  1  2  3

In [45]:
pd.read_csv('Database/data/ex7.csv', dtype=str).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       2 non-null      object
 1   b       2 non-null      object
 2   c       2 non-null      object
dtypes: object(3)
memory usage: 180.0+ bytes

In [48]:
# 上面是对比

In [49]:
# read excel 
pd.read_excel('Database/data/out3.xls', sheet_name=0)

  Unnamed: 0  one  two  three  four  five
0          A   58   69   47.0    18    65
1          B    6   53   74.0    84    10
2          C   74   83    NaN    91    57
3          D   24   65   10.0    30    44

In [50]:
pd.read_excel('Database/data/out3.xls', sheet_name='data11')

  Unnamed: 0  one  two  three  four  five
0          A   58   69   47.0    18    65
1          B    6   53   74.0    84    10
2          C   74   83    NaN    91    57
3          D   24   65   10.0    30    44

In [51]:
pd.read_excel('Database/data/out3.xls', sheet_name='data11', index_col=0)

   one  two  three  four  five
A   58   69   47.0    18    65
B    6   53   74.0    84    10
C   74   83    NaN    91    57
D   24   65   10.0    30    44

In [52]:
pd.read_excel('Database/data/out3.xls', sheet_name='data11').drop('Unnamed: 0', axis = 1)

   one  two  three  four  five
0   58   69   47.0    18    65
1    6   53   74.0    84    10
2   74   83    NaN    91    57
3   24   65   10.0    30    44

In [53]:
pd.read_excel('Database/data/out3.xlsx', sheet_name='王者')

,Unnamed: 0,ename,cname,title,new_type,hero_type,skin_name,hero_type2,pay_type
0,0,105,廉颇,正义爆轰,0,3,正义爆轰|地狱岩魂,NaN,NaN
1,1,106,小乔,恋之微风,0,2,恋之微风|万圣前夜|天鹅之梦|纯白花嫁|缤纷独角兽,NaN,NaN
2,2,107,赵云,苍天翔龙,0,1,苍天翔龙|忍●炎影|未来纪元|皇家上将|嘻哈天王|白执事|引擎之心,4.0,NaN
3,3,108,墨子,和平守望,0,2,和平守望|金属风暴|龙骑士|进击墨子号,1.0,NaN
4,4,109,妲己,魅力之狐,0,2,魅惑之狐|女仆咖啡|魅力维加斯|仙境爱丽丝|少女阿狸|热情桑巴,NaN,11.0
...,...,...,...,...,...,...,...,...,...
99,99,527,蒙恬,秩序统将,0,1,秩序统将|秩序猎龙将,3.0,NaN
100,100,533,阿古朵,山林之子,0,3,山林之子,6.0,NaN
101,101,536,夏洛特,玫瑰剑士,0,1,玫瑰剑士,NaN,NaN
102,102,528,澜,鲨之猎刃,0,4,鲨之猎刃,NaN,NaN
103,103,537,司空震,雷霆之王,1,1,雷霆之王,2.0,NaN

In [61]:
df1 = pd.read_excel('Database/data/out3.xlsx', sheet_name='王者')
df1

,Unnamed: 0,ename,cname,title,new_type,hero_type,skin_name,hero_type2,pay_type
0,0,105,廉颇,正义爆轰,0,3,正义爆轰|地狱岩魂,NaN,NaN
1,1,106,小乔,恋之微风,0,2,恋之微风|万圣前夜|天鹅之梦|纯白花嫁|缤纷独角兽,NaN,NaN
2,2,107,赵云,苍天翔龙,0,1,苍天翔龙|忍●炎影|未来纪元|皇家上将|嘻哈天王|白执事|引擎之心,4.0,NaN
3,3,108,墨子,和平守望,0,2,和平守望|金属风暴|龙骑士|进击墨子号,1.0,NaN
4,4,109,妲己,魅力之狐,0,2,魅惑之狐|女仆咖啡|魅力维加斯|仙境爱丽丝|少女阿狸|热情桑巴,NaN,11.0
...,...,...,...,...,...,...,...,...,...
99,99,527,蒙恬,秩序统将,0,1,秩序统将|秩序猎龙将,3.0,NaN
100,100,533,阿古朵,山林之子,0,3,山林之子,6.0,NaN
101,101,536,夏洛特,玫瑰剑士,0,1,玫瑰剑士,NaN,NaN
102,102,528,澜,鲨之猎刃,0,4,鲨之猎刃,NaN,NaN
103,103,537,司空震,雷霆之王,1,1,雷霆之王,2.0,NaN

In [62]:
df1.drop('Unnamed: 0', axis = 1, inplace = True)

In [63]:
df1

,ename,cname,title,new_type,hero_type,skin_name,hero_type2,pay_type
0,105,廉颇,正义爆轰,0,3,正义爆轰|地狱岩魂,NaN,NaN
1,106,小乔,恋之微风,0,2,恋之微风|万圣前夜|天鹅之梦|纯白花嫁|缤纷独角兽,NaN,NaN
2,107,赵云,苍天翔龙,0,1,苍天翔龙|忍●炎影|未来纪元|皇家上将|嘻哈天王|白执事|引擎之心,4.0,NaN
3,108,墨子,和平守望,0,2,和平守望|金属风暴|龙骑士|进击墨子号,1.0,NaN
4,109,妲己,魅力之狐,0,2,魅惑之狐|女仆咖啡|魅力维加斯|仙境爱丽丝|少女阿狸|热情桑巴,NaN,11.0
...,...,...,...,...,...,...,...,...
99,527,蒙恬,秩序统将,0,1,秩序统将|秩序猎龙将,3.0,NaN
100,533,阿古朵,山林之子,0,3,山林之子,6.0,NaN
101,536,夏洛特,玫瑰剑士,0,1,玫瑰剑士,NaN,NaN
102,528,澜,鲨之猎刃,0,4,鲨之猎刃,NaN,NaN
103,537,司空震,雷霆之王,1,1,雷霆之王,2.0,NaN

In [66]:
df1.to_csv('Database/data/rongyao.csv', index = False) # remove index

In [68]:
# df1.to_excel('Database/data/ry.xlsx', sheet_name = 'rongyao')

In [69]:
df1.rename(columns = {'cname':'英雄名称'})

,ename,英雄名称,title,new_type,hero_type,skin_name,hero_type2,pay_type
0,105,廉颇,正义爆轰,0,3,正义爆轰|地狱岩魂,NaN,NaN
1,106,小乔,恋之微风,0,2,恋之微风|万圣前夜|天鹅之梦|纯白花嫁|缤纷独角兽,NaN,NaN
2,107,赵云,苍天翔龙,0,1,苍天翔龙|忍●炎影|未来纪元|皇家上将|嘻哈天王|白执事|引擎之心,4.0,NaN
3,108,墨子,和平守望,0,2,和平守望|金属风暴|龙骑士|进击墨子号,1.0,NaN
4,109,妲己,魅力之狐,0,2,魅惑之狐|女仆咖啡|魅力维加斯|仙境爱丽丝|少女阿狸|热情桑巴,NaN,11.0
...,...,...,...,...,...,...,...,...
99,527,蒙恬,秩序统将,0,1,秩序统将|秩序猎龙将,3.0,NaN
100,533,阿古朵,山林之子,0,3,山林之子,6.0,NaN
101,536,夏洛特,玫瑰剑士,0,1,玫瑰剑士,NaN,NaN
102,528,澜,鲨之猎刃,0,4,鲨之猎刃,NaN,NaN
103,537,司空震,雷霆之王,1,1,雷霆之王,2.0,NaN

In [71]:
df1 # no change

,ename,cname,title,new_type,hero_type,skin_name,hero_type2,pay_type
0,105,廉颇,正义爆轰,0,3,正义爆轰|地狱岩魂,NaN,NaN
1,106,小乔,恋之微风,0,2,恋之微风|万圣前夜|天鹅之梦|纯白花嫁|缤纷独角兽,NaN,NaN
2,107,赵云,苍天翔龙,0,1,苍天翔龙|忍●炎影|未来纪元|皇家上将|嘻哈天王|白执事|引擎之心,4.0,NaN
3,108,墨子,和平守望,0,2,和平守望|金属风暴|龙骑士|进击墨子号,1.0,NaN
4,109,妲己,魅力之狐,0,2,魅惑之狐|女仆咖啡|魅力维加斯|仙境爱丽丝|少女阿狸|热情桑巴,NaN,11.0
...,...,...,...,...,...,...,...,...
99,527,蒙恬,秩序统将,0,1,秩序统将|秩序猎龙将,3.0,NaN
100,533,阿古朵,山林之子,0,3,山林之子,6.0,NaN
101,536,夏洛特,玫瑰剑士,0,1,玫瑰剑士,NaN,NaN
102,528,澜,鲨之猎刃,0,4,鲨之猎刃,NaN,NaN
103,537,司空震,雷霆之王,1,1,雷霆之王,2.0,NaN

In [72]:
df1.rename(columns = {'cname':'英雄名称'}, inplace = True)

In [73]:
df1

,ename,英雄名称,title,new_type,hero_type,skin_name,hero_type2,pay_type
0,105,廉颇,正义爆轰,0,3,正义爆轰|地狱岩魂,NaN,NaN
1,106,小乔,恋之微风,0,2,恋之微风|万圣前夜|天鹅之梦|纯白花嫁|缤纷独角兽,NaN,NaN
2,107,赵云,苍天翔龙,0,1,苍天翔龙|忍●炎影|未来纪元|皇家上将|嘻哈天王|白执事|引擎之心,4.0,NaN
3,108,墨子,和平守望,0,2,和平守望|金属风暴|龙骑士|进击墨子号,1.0,NaN
4,109,妲己,魅力之狐,0,2,魅惑之狐|女仆咖啡|魅力维加斯|仙境爱丽丝|少女阿狸|热情桑巴,NaN,11.0
...,...,...,...,...,...,...,...,...
99,527,蒙恬,秩序统将,0,1,秩序统将|秩序猎龙将,3.0,NaN
100,533,阿古朵,山林之子,0,3,山林之子,6.0,NaN
101,536,夏洛特,玫瑰剑士,0,1,玫瑰剑士,NaN,NaN
102,528,澜,鲨之猎刃,0,4,鲨之猎刃,NaN,NaN
103,537,司空震,雷霆之王,1,1,雷霆之王,2.0,NaN

In [74]:
# Modify the data type of a column
df3 = pd.read_excel('Database/data/out3.xls', sheet_name=0)

In [75]:
df3

  Unnamed: 0  one  two  three  four  five
0          A   58   69   47.0    18    65
1          B    6   53   74.0    84    10
2          C   74   83    NaN    91    57
3          D   24   65   10.0    30    44

In [76]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  4 non-null      object
 1   one         4 non-null      int64
 2   two         4 non-null      int64
 3   three       3 non-null      float64
 4   four        4 non-null      int64
 5   five        4 non-null      int64
dtypes: float64(1), int64(4), object(1)
memory usage: 324.0+ bytes

In [80]:
df3['fivex'] = df3['five'].astype(str)

In [81]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  4 non-null      object
 1   one         4 non-null      int64
 2   two         4 non-null      int64
 3   three       3 non-null      float64
 4   four        4 non-null      int64
 5   five        4 non-null      int64
 6   fivex       4 non-null      object
dtypes: float64(1), int64(4), object(2)
memory usage: 356.0+ bytes

In [82]:
df3['fivex2'] = df3['fivex'].astype(int)

In [83]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  4 non-null      object
 1   one         4 non-null      int64
 2   two         4 non-null      int64
 3   three       3 non-null      float64
 4   four        4 non-null      int64
 5   five        4 non-null      int64
 6   fivex       4 non-null      object
 7   fivex2      4 non-null      int32
dtypes: float64(1), int32(1), int64(4), object(2)
memory usage: 372.0+ bytes

# Work 6-2

In [101]:
df_JD = pd.read_csv('Database/JD.csv', encoding = 'GBK')
df_JD

                         商品名称        一级分类          二级分类  7天点击量     定价  订单预定
0        ASP.NET项目开发实战入门（全彩版）   编程语言与程序设计       ASP.NET     35   69.8     1
1            PHP项目开发实战入门（全彩版）   编程语言与程序设计           PHP     49   69.8     0
2           Java精彩编程200例（全彩版）   编程语言与程序设计          Java     51   79.8     2
3                零基础学PHP（全彩版）   编程语言与程序设计           PHP     64   79.8     1
4            JSP项目开发实战入门（全彩版）   编程语言与程序设计   JSP/JavaWeb     26   69.8     0
5             C#精彩编程200例（全彩版）   编程语言与程序设计            C#     60   89.8     1
6                零基础学C语言（全彩版）   编程语言与程序设计       C++/C语言    227   69.8    11
7         零基础学JavaScript（全彩版）  网页制作/Web技术    JavaScript    100   79.8     7
8             C#项目开发实战入门（全彩版）   编程语言与程序设计            C#    122   69.8     3
9            C语言项目开发实战入门（全彩版）   编程语言与程序设计       C++/C语言    111   59.8     5
10           零基础学Android（全彩版）        移动开发       Android     85   89.8     4
11               零基础学C++（全彩版）   编程语言与程序设计       C++/C语言    165   79.8     5
12       JavaWeb项目开发实战入门（全彩版）   编程语言与程序设计   JSP/JavaWeb    131   69.8     1
13              零基础学Java（全彩版）   编程语言与程序设计          Java    149   69.8    10
14        零基础学HTML5+CSS3（全彩版）  网页制作/Web技术          HTML    188   79.8     8
15            零基础学Python（全彩版）   编程语言与程序设计        Python   1139   79.8    79
16              Java开发详解（全彩版）   编程语言与程序设计          Java    125  119.0     1
17            案例学WEB前端开发（全彩版）  网页制作/Web技术         WEB前端     57   49.8     0
18           C++项目开发实战入门（全彩版）   编程语言与程序设计       C++/C语言    149   69.8     4
19       Android精彩编程200例（全彩版）        移动开发       Android     32   89.8     1
20           零基础学ASP.NET（全彩版）   编程语言与程序设计       ASP.NET     52   79.8     1
21        Python从入门到项目实践（全彩版）   编程语言与程序设计        Python    597   99.8    25
22        Python项目开发案例集锦（全彩版）   编程语言与程序设计        Python    474  128.0    15
23          Java项目开发实战入门（全彩版）   编程语言与程序设计          Java     83   59.8     3
24       Android项目开发实战入门（全彩版）        移动开发       Android     85   59.8     2
25            零基础学Oracle（全彩版）         数据库        Oracle     58   79.8     2
26                零基础学C#（全彩版）   编程语言与程序设计            C#    132   79.8     8
27               SQL即查即用（全彩版）         数据库           SQL    128   49.8    13
28           Android开发详解（全彩版）        移动开发       Android     59  119.0     0
29             玩转C语言程序设计（全彩版）   编程语言与程序设计       C++/C语言     27   49.8     2
30            Python编程锦囊（全彩版）   编程语言与程序设计        Python    239   79.8    13
31           C语言精彩编程200例（全彩版）   编程语言与程序设计       C++/C语言     45   79.8     1
32  Visual Basic精彩编程200例（全彩版）   编程语言与程序设计  Visual Basic     28   79.8     0

In [4]:
df_JD.二级分类.sum()

'ASP.NETPHPJavaPHPJSP/JavaWebC#C++/C语言JavaScriptC#C++/C语言AndroidC++/C语言JSP/JavaWebJavaHTMLPythonJavaWEB前端C++/C语言AndroidASP.NETPythonPythonJavaAndroidOracleC#SQLAndroidC++/C语言PythonC++/C语言Visual Basic'

In [5]:
df_JD.二级分类.count()

33

In [6]:
df_JD.定价.mean()

78.18181818181819

In [8]:
#Aggregate Data
df_JD.groupby(['一级分类'])

In [9]:
list(df_JD.groupby(['一级分类']))

[(('数据库',),
                 商品名称 一级分类    二级分类  7天点击量    定价  订单预定
  25  零基础学Oracle（全彩版）  数据库  Oracle     58  79.8     2
  27     SQL即查即用（全彩版）  数据库     SQL    128  49.8    13),
 (('移动开发',),
                      商品名称  一级分类     二级分类  7天点击量     定价  订单预定
  10      零基础学Android（全彩版）  移动开发  Android     85   89.8     4
  19  Android精彩编程200例（全彩版）  移动开发  Android     32   89.8     1
  24  Android项目开发实战入门（全彩版）  移动开发  Android     85   59.8     2
  28      Android开发详解（全彩版）  移动开发  Android     59  119.0     0),
 (('编程语言与程序设计',),
                           商品名称       一级分类          二级分类  7天点击量     定价  订单预定
  0        ASP.NET项目开发实战入门（全彩版）  编程语言与程序设计       ASP.NET     35   69.8     1
  1            PHP项目开发实战入门（全彩版）  编程语言与程序设计           PHP     49   69.8     0
  2           Java精彩编程200例（全彩版）  编程语言与程序设计          Java     51   79.8     2
  3                零基础学PHP（全彩版）  编程语言与程序设计           PHP     64   79.8     1
  4            JSP项目开发实战入门（全彩版）  编程语言与程序设计   JSP/JavaWeb     26   69.8     0
  5             C#精彩编程200例（全彩版）  编程语言与程序设计            C#     60   89.8     1
  6                零基础学C语言（全彩版）  编程语言与程序设计       C++/C语言    227   69.8    11
  8             C#项目开发实战入门（全彩版）  编程语言与程序设计            C#    122   69.8     3
  9            C语言项目开发实战入门（全彩版）  编程语言与程序设计       C++/C语言    111   59.8     5
  11               零基础学C++（全彩版）  编程语言与程序设计       C++/C语言    165   79.8     5
  12       JavaWeb项目开发实战入门（全彩版）  编程语言与程序设计   JSP/JavaWeb    131   69.8     1
  13              零基础学Java（全彩版）  编程语言与程序设计          Java    149   69.8    10
  15            零基础学Python（全彩版）  编程语言与程序设计        Python   1139   79.8    79
  16              Java开发详解（全彩版）  编程语言与程序设计          Java    125  119.0     1
  18           C++项目开发实战入门（全彩版）  编程语言与程序设计       C++/C语言    149   69.8     4
  20           零基础学ASP.NET（全彩版）  编程语言与程序设计       ASP.NET     52   79.8     1
  21        Python从入门到项目实践（全彩版）  编程语言与程序设计        Python    597   99.8    25
  22        Python项目开发案例集锦（全彩版）  编程语言与程序设计        Python    474  128.0    15
  23          Java项目开发实战入门（全彩版）  编程语言与程序设计          Java     83   59.8     3
  26                零基础学C#（全彩版）  编程语言与程序设计            C#    132   79.8     8
  29             玩转C语言程序设计（全彩版）  编程语言与程序设计       C++/C语言     27   49.8     2
  30            Python编程锦囊（全彩版）  编程语言与程序设计        Python    239   79.8    13
  31           C语言精彩编程200例（全彩版）  编程语言与程序设计       C++/C语言     45   79.8     1
  32  Visual Basic精彩编程200例（全彩版）  编程语言与程序设计  Visual Basic     28   79.8     0),
 (('网页制作/Web技术',),
                     商品名称        一级分类        二级分类  7天点击量    定价  订单预定
  7   零基础学JavaScript（全彩版）  网页制作/Web技术  JavaScript    100  79.8     7
  14  零基础学HTML5+CSS3（全彩版）  网页制作/Web技术        HTML    188  79.8     8
  17      案例学WEB前端开发（全彩版）  网页制作/Web技术       WEB前端     57  49.8     0)]

In [10]:
df_JD.groupby(['一级分类']).sum()

,商品名称,二级分类,7天点击量,定价,订单预定
一级分类,,,,,
数据库,零基础学Oracle（全彩版）SQL即查即用（全彩版）,OracleSQL,186,129.6,15
移动开发,零基础学Android（全彩版）Android精彩编程200例（全彩版）Android项目开...,AndroidAndroidAndroidAndroid,261,358.4,7
编程语言与程序设计,ASP.NET项目开发实战入门（全彩版）PHP项目开发实战入门（全彩版）Java精彩编程20...,ASP.NETPHPJavaPHPJSP/JavaWebC#C++/C语言C#C++/C语言...,4280,1882.6,192
网页制作/Web技术,零基础学JavaScript（全彩版）零基础学HTML5+CSS3（全彩版）案例学WEB前端...,JavaScriptHTMLWEB前端,345,209.4,15

In [12]:
list(df_JD.groupby(['一级分类'])[['7天点击量', '订单预定']])

[(('数据库',),
      7天点击量  订单预定
  25     58     2
  27    128    13),
 (('移动开发',),
      7天点击量  订单预定
  10     85     4
  19     32     1
  24     85     2
  28     59     0),
 (('编程语言与程序设计',),
      7天点击量  订单预定
  0      35     1
  1      49     0
  2      51     2
  3      64     1
  4      26     0
  5      60     1
  6     227    11
  8     122     3
  9     111     5
  11    165     5
  12    131     1
  13    149    10
  15   1139    79
  16    125     1
  18    149     4
  20     52     1
  21    597    25
  22    474    15
  23     83     3
  26    132     8
  29     27     2
  30    239    13
  31     45     1
  32     28     0),
 (('网页制作/Web技术',),
      7天点击量  订单预定
  7     100     7
  14    188     8
  17     57     0)]

In [14]:
# Summarize by primary category
df_JD.groupby(['一级分类'])[['7天点击量', '订单预定']].sum()

            7天点击量  订单预定
一级分类
数据库           186    15
移动开发          261     7
编程语言与程序设计    4280   192
网页制作/Web技术    345    15

In [16]:
df_JD[['一级分类','7天点击量','订单预定']].groupby('一级分类').sum()

            7天点击量  订单预定
一级分类
数据库           186    15
移动开发          261     7
编程语言与程序设计    4280   192
网页制作/Web技术    345    15

In [18]:
# Summarize by primary and secondary categories
df_JD.groupby(['一级分类','二级分类'])
#Using multiple columns for groupby can return an object with hierarchical indexing.

In [19]:
list(df_JD.groupby(['一级分类','二级分类']))

[(('数据库', 'Oracle'),
                 商品名称 一级分类    二级分类  7天点击量    定价  订单预定
  25  零基础学Oracle（全彩版）  数据库  Oracle     58  79.8     2),
 (('数据库', 'SQL'),
              商品名称 一级分类 二级分类  7天点击量    定价  订单预定
  27  SQL即查即用（全彩版）  数据库  SQL    128  49.8    13),
 (('移动开发', 'Android'),
                      商品名称  一级分类     二级分类  7天点击量     定价  订单预定
  10      零基础学Android（全彩版）  移动开发  Android     85   89.8     4
  19  Android精彩编程200例（全彩版）  移动开发  Android     32   89.8     1
  24  Android项目开发实战入门（全彩版）  移动开发  Android     85   59.8     2
  28      Android开发详解（全彩版）  移动开发  Android     59  119.0     0),
 (('编程语言与程序设计', 'ASP.NET'),
                      商品名称       一级分类     二级分类  7天点击量    定价  订单预定
  0   ASP.NET项目开发实战入门（全彩版）  编程语言与程序设计  ASP.NET     35  69.8     1
  20      零基础学ASP.NET（全彩版）  编程语言与程序设计  ASP.NET     52  79.8     1),
 (('编程语言与程序设计', 'C#'),
                 商品名称       一级分类 二级分类  7天点击量    定价  订单预定
  5   C#精彩编程200例（全彩版）  编程语言与程序设计   C#     60  89.8     1
  8   C#项目开发实战入门（全彩版）  编程语言与程序设计   C#    122  69.8     3
  26      零基础学C#（全彩版）  编程语言与程序设计   C#    132  79.8     8),
 (('编程语言与程序设计', 'C++/C语言'),
                  商品名称       一级分类     二级分类  7天点击量    定价  订单预定
  6       零基础学C语言（全彩版）  编程语言与程序设计  C++/C语言    227  69.8    11
  9   C语言项目开发实战入门（全彩版）  编程语言与程序设计  C++/C语言    111  59.8     5
  11      零基础学C++（全彩版）  编程语言与程序设计  C++/C语言    165  79.8     5
  18  C++项目开发实战入门（全彩版）  编程语言与程序设计  C++/C语言    149  69.8     4
  29    玩转C语言程序设计（全彩版）  编程语言与程序设计  C++/C语言     27  49.8     2
  31  C语言精彩编程200例（全彩版）  编程语言与程序设计  C++/C语言     45  79.8     1),
 (('编程语言与程序设计', 'JSP/JavaWeb'),
                      商品名称       一级分类         二级分类  7天点击量    定价  订单预定
  4       JSP项目开发实战入门（全彩版）  编程语言与程序设计  JSP/JavaWeb     26  69.8     0
  12  JavaWeb项目开发实战入门（全彩版）  编程语言与程序设计  JSP/JavaWeb    131  69.8     1),
 (('编程语言与程序设计', 'Java'),
                   商品名称       一级分类  二级分类  7天点击量     定价  订单预定
  2   Java精彩编程200例（全彩版）  编程语言与程序设计  Java     51   79.8     2
  13      零基础学Java（全彩版）  编程语言与程序设计  Java    149   69.8    10
  16      Java开发详解（全彩版）  编程语言与程序设计  Java    125  119.0     1
  23  Java项目开发实战入门（全彩版）  编程语言与程序设计  Java     83   59.8     3),
 (('编程语言与程序设计', 'PHP'),
                 商品名称       一级分类 二级分类  7天点击量    定价  订单预定
  1  PHP项目开发实战入门（全彩版）  编程语言与程序设计  PHP     49  69.8     0
  3      零基础学PHP（全彩版）  编程语言与程序设计  PHP     64  79.8     1),
 (('编程语言与程序设计', 'Python'),
                     商品名称       一级分类    二级分类  7天点击量     定价  订单预定
  15      零基础学Python（全彩版）  编程语言与程序设计  Python   1139   79.8    79
  21  Python从入门到项目实践（全彩版）  编程语言与程序设计  Python    597   99.8    25
  22  Python项目开发案例集锦（全彩版）  编程语言与程序设计  Python    474  128.0    15
  30      Python编程锦囊（全彩版）  编程语言与程序设计  Python    239   79.8    13),
 (('编程语言与程序设计', 'Visual Basic'),
                           商品名称       一级分类          二级分类  7天点击量    定价  订单预定
  32  Visual Basic精彩编程200例（全彩版）  编程语言与程序设计  Visual Basic     28  79.8     0),
 (('网页制作/Web技术', 'HTML'),
                     商品名称        一级分类  二级分类  7天点击量    定价  订单预定
  14  零基础学HTML5+CSS3（全彩版）  网页制作/Web技术  HTML    188  79.8     8),
 (('网页制作/Web技术', 'JavaScript'),
                    商品名称        一级分类        二级分类  7天点击量    定价  订单预定
  7  零基础学JavaScript（全彩版）  网页制作/Web技术  JavaScript    100  79.8     7),
 (('网页制作/Web技术', 'WEB前端'),
                 商品名称        一级分类   二级分类  7天点击量    定价  订单预定
  17  案例学WEB前端开发（全彩版）  网页制作/Web技术  WEB前端     57  49.8     0)]

In [20]:
df_JD.groupby(['一级分类','二级分类'])[['7天点击量','订单预定']].sum()
#先分类，再筛选，最后计算。

                         7天点击量  订单预定
一级分类       二级分类
数据库        Oracle           58     2
           SQL             128    13
移动开发       Android         261     7
编程语言与程序设计  ASP.NET          87     2
           C#              314    12
           C++/C语言         724    28
           JSP/JavaWeb     157     1
           Java            408    16
           PHP             113     1
           Python         2449   132
           Visual Basic     28     0
网页制作/Web技术 HTML            188     8
           JavaScript      100     7
           WEB前端            57     0

In [21]:
df_JD.groupby('二级分类')['7天点击量'].sum()

二级分类
ASP.NET           87
Android          261
C#               314
C++/C语言          724
HTML             188
JSP/JavaWeb      157
Java             408
JavaScript       100
Oracle            58
PHP              113
Python          2449
SQL              128
Visual Basic      28
WEB前端             57
Name: 7天点击量, dtype: int64

# Hierarchical indexing and pivot tables

In [84]:
s1 = pd.Series(np.random.randn(10),
               index = [
                   ['a'] * 3 + ['b'] * 3 + ['c'] * 2 + ['d'] * 2,
                   list(range(1,11))
               ])

In [85]:
s1

a  1    -1.346404
   2    -1.576361
   3     0.284163
b  4    -1.166440
   5    -0.023831
   6     0.436779
c  7     1.321398
   8     1.249833
d  9    -0.686910
   10    0.749371
dtype: float64

In [86]:
dft1 = pd.DataFrame(np.random.randint(10, 20, (2,3)),
                   index = pd.Index(['北京', '上海'], name = 'city'),
                   columns = pd.Index([2019,2020,2021], name = 'year'))

In [88]:
dft1 # pivot table

year  2019  2020  2021
city
北京      12    18    14
上海      18    10    18

In [89]:
dft1.stack() # unpivot

city  year
北京    2019    12
      2020    18
      2021    14
上海    2019    18
      2020    10
      2021    18
dtype: int32

In [90]:
type(dft1.stack())

pandas.core.series.Series

In [91]:
st1 = dft1.stack()

In [92]:
st1.index

MultiIndex([('北京', 2019),
            ('北京', 2020),
            ('北京', 2021),
            ('上海', 2019),
            ('上海', 2020),
            ('上海', 2021)],
           names=['city', 'year'])

In [93]:
st1.unstack()

year  2019  2020  2021
city
北京      12    18    14
上海      18    10    18

In [95]:
# 对Series
s1.unstack()

,1,2,3,4,5,6,7,8,9,10
a,-1.346404,-1.576361,0.284163,NaN,NaN,NaN,NaN,NaN,NaN,NaN
b,NaN,NaN,NaN,-1.16644,-0.023831,0.436779,NaN,NaN,NaN,NaN
c,NaN,NaN,NaN,NaN,NaN,NaN,1.321398,1.249833,NaN,NaN
d,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,-0.68691,0.749371

In [96]:
s2 = pd.Series(np.random.randn(10),
               index = [
                   ['a'] * 3 + ['b'] * 3 + ['c'] * 2 + ['d'] * 2,
                   [1,2,3,1,2,3,1,2,3,4]
               ])

In [97]:
s2

a  1    0.020563
   2   -1.164928
   3   -1.132479
b  1   -0.682164
   2    0.156140
   3    0.287385
c  1   -0.077997
   2    1.934479
d  3   -1.423486
   4    0.018410
dtype: float64

In [98]:
s2.unstack()

          1         2         3        4
a  0.020563 -1.164928 -1.132479      NaN
b -0.682164  0.156140  0.287385      NaN
c -0.077997  1.934479       NaN      NaN
d       NaN       NaN -1.423486  0.01841

In [99]:
 s3 = pd.Series(np.random.randn(9),
               index = [
                   ['a'] * 3 + ['b'] * 3 + ['c'] * 3,
                   [1,2,3,1,2,3,1,2,3]
               ])
s3

a  1    1.328861
   2   -0.378230
   3   -0.043818
b  1   -1.316048
   2   -1.424858
   3    0.182850
c  1   -0.262463
   2   -1.782233
   3   -0.905026
dtype: float64

In [100]:
s3.unstack()

          1         2         3
a  1.328861 -0.378230 -0.043818
b -1.316048 -1.424858  0.182850
c -0.262463 -1.782233 -0.905026

In [102]:
# From a data table to a pivot table
df_JD

                         商品名称        一级分类          二级分类  7天点击量     定价  订单预定
0        ASP.NET项目开发实战入门（全彩版）   编程语言与程序设计       ASP.NET     35   69.8     1
1            PHP项目开发实战入门（全彩版）   编程语言与程序设计           PHP     49   69.8     0
2           Java精彩编程200例（全彩版）   编程语言与程序设计          Java     51   79.8     2
3                零基础学PHP（全彩版）   编程语言与程序设计           PHP     64   79.8     1
4            JSP项目开发实战入门（全彩版）   编程语言与程序设计   JSP/JavaWeb     26   69.8     0
5             C#精彩编程200例（全彩版）   编程语言与程序设计            C#     60   89.8     1
6                零基础学C语言（全彩版）   编程语言与程序设计       C++/C语言    227   69.8    11
7         零基础学JavaScript（全彩版）  网页制作/Web技术    JavaScript    100   79.8     7
8             C#项目开发实战入门（全彩版）   编程语言与程序设计            C#    122   69.8     3
9            C语言项目开发实战入门（全彩版）   编程语言与程序设计       C++/C语言    111   59.8     5
10           零基础学Android（全彩版）        移动开发       Android     85   89.8     4
11               零基础学C++（全彩版）   编程语言与程序设计       C++/C语言    165   79.8     5
12       JavaWeb项目开发实战入门（全彩版）   编程语言与程序设计   JSP/JavaWeb    131   69.8     1
13              零基础学Java（全彩版）   编程语言与程序设计          Java    149   69.8    10
14        零基础学HTML5+CSS3（全彩版）  网页制作/Web技术          HTML    188   79.8     8
15            零基础学Python（全彩版）   编程语言与程序设计        Python   1139   79.8    79
16              Java开发详解（全彩版）   编程语言与程序设计          Java    125  119.0     1
17            案例学WEB前端开发（全彩版）  网页制作/Web技术         WEB前端     57   49.8     0
18           C++项目开发实战入门（全彩版）   编程语言与程序设计       C++/C语言    149   69.8     4
19       Android精彩编程200例（全彩版）        移动开发       Android     32   89.8     1
20           零基础学ASP.NET（全彩版）   编程语言与程序设计       ASP.NET     52   79.8     1
21        Python从入门到项目实践（全彩版）   编程语言与程序设计        Python    597   99.8    25
22        Python项目开发案例集锦（全彩版）   编程语言与程序设计        Python    474  128.0    15
23          Java项目开发实战入门（全彩版）   编程语言与程序设计          Java     83   59.8     3
24       Android项目开发实战入门（全彩版）        移动开发       Android     85   59.8     2
25            零基础学Oracle（全彩版）         数据库        Oracle     58   79.8     2
26                零基础学C#（全彩版）   编程语言与程序设计            C#    132   79.8     8
27               SQL即查即用（全彩版）         数据库           SQL    128   49.8    13
28           Android开发详解（全彩版）        移动开发       Android     59  119.0     0
29             玩转C语言程序设计（全彩版）   编程语言与程序设计       C++/C语言     27   49.8     2
30            Python编程锦囊（全彩版）   编程语言与程序设计        Python    239   79.8    13
31           C语言精彩编程200例（全彩版）   编程语言与程序设计       C++/C语言     45   79.8     1
32  Visual Basic精彩编程200例（全彩版）   编程语言与程序设计  Visual Basic     28   79.8     0

In [103]:
df_JD.groupby(['一级分类', '二级分类'])['7天点击量'].sum()

一级分类        二级分类
数据库         Oracle            58
            SQL              128
移动开发        Android          261
编程语言与程序设计   ASP.NET           87
            C#               314
            C++/C语言          724
            JSP/JavaWeb      157
            Java             408
            PHP              113
            Python          2449
            Visual Basic      28
网页制作/Web技术  HTML             188
            JavaScript       100
            WEB前端             57
Name: 7天点击量, dtype: int64

In [104]:
type(df_JD.groupby(['一级分类', '二级分类'])['7天点击量'].sum())

pandas.core.series.Series

In [105]:
df_JD.groupby(['一级分类', '二级分类'])['7天点击量'].sum().unstack()

二级分类,ASP.NET,Android,C#,C++/C语言,HTML,JSP/JavaWeb,Java,JavaScript,Oracle,PHP,Python,SQL,Visual Basic,WEB前端
一级分类,,,,,,,,,,,,,,
数据库,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,58.0,NaN,NaN,128.0,NaN,NaN
移动开发,NaN,261.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
编程语言与程序设计,87.0,NaN,314.0,724.0,NaN,157.0,408.0,NaN,NaN,113.0,2449.0,NaN,28.0,NaN
网页制作/Web技术,NaN,NaN,NaN,NaN,188.0,NaN,NaN,100.0,NaN,NaN,NaN,NaN,NaN,57.0

## Bank dataset analysis and pivot tables

In [106]:
df_bank = pd.read_csv('Database/data/bank-full.csv', sep = ';')

In [108]:
df_bank.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no

In [109]:
df_bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45211 entries, 0 to 45210
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        45211 non-null  int64
 1   job        45211 non-null  object
 2   marital    45211 non-null  object
 3   education  45211 non-null  object
 4   default    45211 non-null  object
 5   balance    45211 non-null  int64
 6   housing    45211 non-null  object
 7   loan       45211 non-null  object
 8   contact    45211 non-null  object
 9   day        45211 non-null  int64
 10  month      45211 non-null  object
 11  duration   45211 non-null  int64
 12  campaign   45211 non-null  int64
 13  pdays      45211 non-null  int64
 14  previous   45211 non-null  int64
 15  poutcome   45211 non-null  object
 16  y          45211 non-null  object
dtypes: int64(7), object(10)
memory usage: 5.9+ MB

In [110]:
df_bank.describe()

,age,balance,day,duration,campaign,pdays,previous
count,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000
mean,40.936210,1362.272058,15.806419,258.163080,2.763841,40.197828,0.580323
std,10.618762,3044.765829,8.322476,257.527812,3.098021,100.128746,2.303441
min,18.000000,-8019.000000,1.000000,0.000000,1.000000,-1.000000,0.000000
25%,33.000000,72.000000,8.000000,103.000000,1.000000,-1.000000,0.000000
50%,39.000000,448.000000,16.000000,180.000000,2.000000,-1.000000,0.000000
75%,48.000000,1428.000000,21.000000,319.000000,3.000000,-1.000000,0.000000
max,95.000000,102127.000000,31.000000,4918.000000,63.000000,871.000000,275.000000

In [111]:
df_bank[['age']].describe()

                age
count  45211.000000
mean      40.936210
std       10.618762
min       18.000000
25%       33.000000
50%       39.000000
75%       48.000000
max       95.000000

In [112]:
df_bank.job.describe()

count           45211
unique             12
top       blue-collar
freq             9732
Name: job, dtype: object

In [113]:
df_bank.groupby('job').age.count()

job
admin.           5171
blue-collar      9732
entrepreneur     1487
housemaid        1240
management       9458
retired          2264
self-employed    1579
services         4154
student           938
technician       7597
unemployed       1303
unknown           288
Name: age, dtype: int64

In [114]:
type(df_bank.groupby('job').age.count())

pandas.core.series.Series

In [115]:
df_bank.groupby('job').age.count().sort_values(ascending = False)

job
blue-collar      9732
management       9458
technician       7597
admin.           5171
services         4154
retired          2264
self-employed    1579
entrepreneur     1487
unemployed       1303
housemaid        1240
student           938
unknown           288
Name: age, dtype: int64

In [116]:
?pd.Series.value_counts

Signature:
pd.Series.value_counts(
    self,
    normalize: 'bool' = False,
    sort: 'bool' = True,
    ascending: 'bool' = False,
    bins=None,
    dropna: 'bool' = True,
) -> 'Series'
Docstring:
Return a Series containing counts of unique values.

The resulting object will be in descending order so that the
first element is the most frequently-occurring element.
Excludes NA values by default.

Parameters
----------
normalize : bool, default False
    If True then the object returned will contain the relative
    frequencies of the unique values.
sort : bool, default True
    Sort by frequencies when True. Preserve the order of the data when False.
ascending : bool, default False
    Sort in ascending order.
bins : int, optional
    Rather than count values, group them into half-open bins,
    a convenience for ``pd.cut``, only works with numeric data.
dropna : bool, default True
    Don't include counts of NaN.

Returns
-------
Series

See Also
--------
Series.count: Number of non-NA elements in a Series.
DataFrame.count: Number of non-NA elements in a DataFrame.
DataFrame.value_counts: Equivalent method on DataFrames.

Examples
--------
>>> index = pd.Index([3, 1, 2, 3, 4, np.nan])
>>> index.value_counts()
3.0    2
1.0    1
2.0    1
4.0    1
Name: count, dtype: int64

With `normalize` set to `True`, returns the relative frequency by
dividing all values by the sum of values.

>>> s = pd.Series([3, 1, 2, 3, 4, np.nan])
>>> s.value_counts(normalize=True)
3.0    0.4
1.0    0.2
2.0    0.2
4.0    0.2
Name: proportion, dtype: float64

**bins**

Bins can be useful for going from a continuous variable to a
categorical variable; instead of counting unique
apparitions of values, divide the index in the specified
number of half-open bins.

>>> s.value_counts(bins=3)
(0.996, 2.0]    2
(2.0, 3.0]      2
(3.0, 4.0]      1
Name: count, dtype: int64

**dropna**

With `dropna` set to `False` we can also see NaN index values.

>>> s.value_counts(dropna=False)
3.0    2
1.0    1
2.0    1
4.0    1
NaN    1
Name: count, dtype: int64
File:      d:\anaconda3\lib\site-packages\pandas\core\base.py
Type:      function

In [117]:
df_bank.education.value_counts()

education
secondary    23202
tertiary     13301
primary       6851
unknown       1857
Name: count, dtype: int64

In [120]:
# The impact of occupation on purchase decisions
df_bank.groupby(['job', 'y']).age.count()

job            y
admin.         no     4540
               yes     631
blue-collar    no     9024
               yes     708
entrepreneur   no     1364
               yes     123
housemaid      no     1131
               yes     109
management     no     8157
               yes    1301
retired        no     1748
               yes     516
self-employed  no     1392
               yes     187
services       no     3785
               yes     369
student        no      669
               yes     269
technician     no     6757
               yes     840
unemployed     no     1101
               yes     202
unknown        no      254
               yes      34
Name: age, dtype: int64

In [132]:
df_bank.groupby(['job', 'y'])['age'].count().unstack()

y                no   yes
job
admin.         4540   631
blue-collar    9024   708
entrepreneur   1364   123
housemaid      1131   109
management     8157  1301
retired        1748   516
self-employed  1392   187
services       3785   369
student         669   269
technician     6757   840
unemployed     1101   202
unknown         254    34

In [122]:
# The average age of people with different educational backgrounds and marital statuses
df_bank.groupby(['education', 'marital']).age.mean().unstack()

marital     divorced    married     single
education
primary    51.494681  46.550705  36.689332
secondary  44.230906  42.363108  33.157171
tertiary   45.429640  42.306053  33.818447
unknown    49.295858  48.287069  34.681818

In [126]:
# 直接构建 更直观 相当于excel中的透视表操作
df_bank.pivot_table(index = ['education'], columns = ['marital'], values = ['age'], aggfunc = ['mean'])

                mean
                 age
marital     divorced    married     single
education
primary    51.494681  46.550705  36.689332
secondary  44.230906  42.363108  33.157171
tertiary   45.429640  42.306053  33.818447
unknown    49.295858  48.287069  34.681818

In [135]:
 # aggfunc default: mean
df_bank.pivot_table(index=['job'], values = ['age', 'duration'])

                     age    duration
job
admin.         39.289886  246.896732
blue-collar    40.044081  262.901562
entrepreneur   42.190989  256.309348
housemaid      46.415323  245.825000
management     40.449567  253.995771
retired        61.626767  287.361307
self-employed  40.484484  268.157061
services       38.740250  259.318729
student        26.542644  246.656716
technician     39.314598  252.904962
unemployed     40.961627  288.543361
unknown        47.593750  237.611111

In [136]:
df_bank.pivot_table(index=['job', 'education'], 
                    columns = ['marital'],
                    values = ['age', 'duration'],
                   aggfunc = ['mean', 'max'])

                              mean                                    \
                               age                          duration
marital                   divorced    married     single    divorced
job           education
admin.        primary    48.033333  46.993289  39.733333  211.400000
              secondary  42.779321  41.297950  34.403343  263.222222
              tertiary   41.500000  37.103306  32.057971  203.685185
              unknown    50.277778  48.000000  37.282609  391.666667
blue-collar   primary    45.978125  43.049315  35.766409  286.637500
              secondary  41.457364  40.132625  32.403963  268.232558
              tertiary   39.750000  39.833333  34.282353  217.250000
              unknown    43.692308  44.487342  36.515152  222.846154
entrepreneur  primary    48.666667  45.076923  36.000000  294.555556
              secondary  45.492537  42.176179  34.625000  221.611940
              tertiary   45.402062  42.900662  35.095588  257.164948
              unknown    51.000000  45.775862  42.500000  575.166667
housemaid     primary    52.866667  48.464646  41.523810  275.688889
              secondary  46.428571  44.525926  37.600000  261.414286
              tertiary   49.277778  43.622807  36.195122  220.111111
              unknown    55.000000  52.151515  54.666667   64.000000
management    primary    50.692308  48.951807  41.210526  208.730769
              secondary  45.963504  44.100000  35.421769  273.897810
              tertiary   44.950927  41.895116  34.292183  253.612868
              unknown    49.903226  48.006211  37.720000  300.903226
retired       primary    65.956790  62.290698  53.580645  276.277778
              secondary  60.527273  60.416021  52.200000  307.690909
              tertiary   59.929412  62.925197  61.037037  360.129412
              unknown    70.769231  65.851485  56.800000  229.846154
self-employed primary    48.333333  45.428571  42.333333  275.666667
              secondary  44.105263  42.985294  34.955357  284.333333
              tertiary   45.815789  41.862222  32.697068  298.434211
              unknown    34.000000  50.739130  34.200000  245.000000
services      primary    47.066667  44.532189  36.461538  237.700000
              secondary  42.339207  40.107592  32.734714  265.693833
              tertiary   44.000000  39.736264  31.814433  195.142857
              unknown    44.952381  44.468085  34.285714  318.190476
student       primary    35.000000  33.500000  21.804878  177.000000
              secondary  33.000000  32.650000  25.482546  406.000000
              tertiary   36.666667  29.136364  27.984848  251.666667
              unknown    27.000000  31.000000  27.473684   15.000000
technician    primary    47.882353  47.912000  40.812500  264.588235
              secondary  43.481638  41.852982  33.878436  229.766949
              tertiary   42.571429  40.282051  33.633929  272.571429
              unknown    45.920000  46.363014  37.084507  322.960000
unemployed    primary    45.740741  44.957317  37.303030  297.629630
              secondary  46.330508  43.562945  33.539683  240.144068
              tertiary   41.040000  40.907692  34.156716  348.280000
              unknown    50.000000  45.375000  38.333333  749.000000
unknown       primary    43.250000  48.615385  41.000000  247.000000
              secondary  47.333333  47.840909  37.833333  277.666667
              tertiary   46.000000  51.840000  36.545455  238.666667
              unknown    59.428571  51.694737  39.680000  257.857143

                                                     max                 \
                                                     age
marital                     married      single divorced married single
job           education
admin.        primary    236.832215  226.866667       59      72     53
              secondary  248.030068  253.928052       66      69     66
              tertiary   202.611570  211.434783       61      61     51
              unknown    234.635514  289.673913       60      75     52
blue-collar   primary    246.629795  274.534749       61      72     61
              secondary  261.482843  289.442835       60      75     59
              tertiary   351.550000  276.941176       51      60     55
              unknown    252.506329  270.313131       59      60     54
entrepreneur  primary    254.096154  259.888889       60      66     50
              secondary  267.362283  298.388889       61      84     53
              tertiary   237.726269  276.448529       59      71     58
              unknown    233.189655  239.750000       59      60     56
housemaid     primary    237.153535  363.595238       83      83     56
              secondary  237.359259  211.036364       67      80     59
              tertiary   248.175439  307.682927       60      63     58
              unknown    208.151515  205.666667       59      74     69
management    primary    221.618474  169.736842       60      80     56
              secondary  254.000000  251.187075       60      73     59
              tertiary   252.839767  259.309598       67      81     66
              unknown    249.000000  251.540000       60      78     58
retired       primary    284.107973  186.580645       95      89     83
              secondary  281.917313  245.066667       94      95     86
              tertiary   300.374016  286.111111       82      89     72
              unknown    305.267327  112.000000       86      93     72
self-employed primary    243.446429  296.083333       56      60     59
              secondary  257.620098  292.866071       62      71     60
              tertiary   241.282222  311.680782       62      72     60
              unknown    253.130435  254.600000       34      76     53
services      primary    251.330472  294.519231       60      62     60
              secondary  253.020111  267.492110       60      60     60
              tertiary   232.747253  304.649485       56      60     47
              unknown    275.329787  226.514286       57      69     51
student       primary    259.000000  195.731707       35      36     34
              secondary  278.200000  246.034908       33      41     41
              tertiary   273.727273  261.505051       38      36     39
              unknown    155.400000  241.651316       27      42     48
technician    primary    232.432000  260.187500       60      61     60
              secondary  245.319348  262.643861       61      71     60
              tertiary   256.936455  273.071429       60      71     60
              unknown    219.801370  288.323944       56      62     55
unemployed    primary    337.640244  296.818182       58      63     66
              secondary  267.413302  298.100529       65      65     59
              tertiary   250.100000  325.597015       56      65     60
              unknown    388.312500  325.166667       50      57     59
unknown       primary    221.564103  168.125000       56      60     61
              secondary  201.113636  296.333333       58      63     59
              tertiary   231.280000  177.272727       54      75     49
              unknown    248.284211  272.960000       82      78     51


                        duration
marital                 divorced married single
job           education
admin.        primary        625    1041    670
              secondary     1776    3284   3183
              tertiary       690    1138   1290
              unknown       1310    1106   1206
blue-collar   primary       2456    3078   2653
              secondary     2231    3366   2260
              tertiary       289    3422   1422
              unknown        967    1486   1806
entrepreneur  primary        688    1503   1051
              secondary      769    1484   1404
              tertiary      1164    2769   1916
              unknown        988    1403    617
housemaid     primary       1558    2692   2093
              secondary     1200    1576   1008
              tertiary       870    1391   1461
              unknown        152     703    376
management    primary        508    1550    475
              secondary     1973    3881   2770
              tertiary      2087    2870   1914
              unknown       1563    1103   1041
retired       primary       1448    2187   1003
              secondary     2055    2635   1063
              tertiary      1357    2027    847
              unknown        562    1348    212
self-employed primary        642    1438   1307
              secondary     1584    1865   1707
              tertiary      1723    3322   3253
              unknown        245     933    795
services      primary       1156    1934   1576
              secondary     3094    1971   3785
              tertiary       662     912   2219
              unknown       1409    1812   1132
student       primary        177     487    819
              secondary      406     929   1730
              tertiary       605    1024   1571
              unknown         15     385   2429
technician    primary        977    1332   1096
              secondary     2150    2775   2420
              tertiary      1992    4918   2516
              unknown       1419    1018   1623
unemployed    primary        924    3025   1205
              secondary     1697    1855   1606
              tertiary      1960     988   1837
              unknown        749     810    791
unknown       primary        422     759    465
              secondary      556     891   1487
              tertiary       385     966    426
              unknown        626    1186   1440